Documents/РазгрузкаАвто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РазгрузкаАвто</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданиеНаДоставку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГМПоложилНаМаршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГМПринял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РТУ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПереноса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереданоНаСклад</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятоСкладом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияСкладом</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаданиеНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаданиеНаДоставку</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаСборку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПоставщика</Name>
					<Comment>!не используется с 09 февраля 2016</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РазгрузкаАвто/Ext/ObjectModule.bsl
Перем ТаблицаОстатков_ПоРегистру_ЗаказыПокупателей;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Грузополучатель) И Не ЗначениеЗаполнено(МаршрутДоставки) Тогда
		МаршрутДоставки = Грузополучатель.МаршрутДоставки;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ , РежимПроведения)

	ТаблицаГМ = Новый ТаблицаЗначений;
	ТаблицаГМ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Документссылка.ГрузовоеМесто")); 
	ТаблицаГМ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная))); 
	
	СписокГМСклад = ТаблицаГМ.Скопировать();
	СписокГМВодитель = ТаблицаГМ.Скопировать();
	
	Если НЕ ГМПоложилНаМаршрут.Пустая() Тогда

		ЗапросРТУ = Новый Запрос;
		ЗапросРТУ.Текст = 
		//+Кабанов А.В. 10.03.2025 # UT10-5127
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазгрузкаАвтоГрузовыеМеста.РТУ,
		|	ВЫБОР
		|		КОГДА (РазгрузкаАвтоГрузовыеМеста.Ссылка.Грузополучатель.ПереносДоставкиБезУдаленияРТУ
		|				ИЛИ (РазгрузкаАвтоГрузовыеМеста.РТУ.ДоговорКонтрагента.ЛицевойСчет
		|					ИЛИ РазгрузкаАвтоГрузовыеМеста.РТУ.ДоговорКонтрагента.РозничнаяПродажа))
		|				И РазгрузкаАвтоГрузовыеМеста.ПереданоНаСклад
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПоменятьСтатус
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
		|ГДЕ
		|	РазгрузкаАвтоГрузовыеМеста.Ссылка = &Разгрузка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РазгрузкаАвтоГрузовыеМеста.РТУ,
		|	ВЫБОР
		|		КОГДА (РазгрузкаАвтоГрузовыеМеста.Ссылка.Грузополучатель.ПереносДоставкиБезУдаленияРТУ
		|				ИЛИ (РазгрузкаАвтоГрузовыеМеста.РТУ.ДоговорКонтрагента.ЛицевойСчет
		|					ИЛИ РазгрузкаАвтоГрузовыеМеста.РТУ.ДоговорКонтрагента.РозничнаяПродажа))
		|				И РазгрузкаАвтоГрузовыеМеста.ПринятоСкладом
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
		|ГДЕ
		|	РазгрузкаАвтоГрузовыеМеста.Ссылка = &Разгрузка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_РТУ.РТУ,
		|	МАКСИМУМ(НЕ ЕСТЬNULL(ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Ссылка, ЗНАЧЕНИЕ(Документ.ВыкупСОтветственногоХранения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.ВыкупСОтветственногоХранения.ПустаяСсылка)) КАК ЕстьВыкуп
		|ПОМЕСТИТЬ ВТ_Выкупы
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения.ДокументыОснованияВыкупаТОХ КАК ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ
		|		ПО ВТ_РТУ.РТУ.Ссылка = ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.ДокументОснование
		|			И (НЕ ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Ссылка.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РТУ.РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.РТУ,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ВТ_Выкупы.ЕстьВыкуп
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВТ_РТУ.ПоменятьСтатус
		|		КОНЕЦ) КАК ПоменятьСтатус
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выкупы КАК ВТ_Выкупы
		|		ПО ВТ_РТУ.РТУ = ВТ_Выкупы.РТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РТУ.РТУ";

		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	РазгрузкаАвтоГрузовыеМеста.РТУ,
		//|	ВЫБОР
		//|		КОГДА РазгрузкаАвтоГрузовыеМеста.Ссылка.Грузополучатель.ПереносДоставкиБезУдаленияРТУ
		//|				И РазгрузкаАвтоГрузовыеМеста.ПереданоНаСклад
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ПоменятьСтатус
		//|ПОМЕСТИТЬ ВТ_РТУ
		//|ИЗ
		//|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
		//|ГДЕ
		//|	РазгрузкаАвтоГрузовыеМеста.Ссылка = &Разгрузка
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	РазгрузкаАвтоГрузовыеМеста.РТУ,
		//|	ВЫБОР
		//|		КОГДА РазгрузкаАвтоГрузовыеМеста.Ссылка.Грузополучатель.ПереносДоставкиБезУдаленияРТУ
		//|				И РазгрузкаАвтоГрузовыеМеста.ПринятоСкладом
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ
		//|ИЗ
		//|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
		//|ГДЕ
		//|	РазгрузкаАвтоГрузовыеМеста.Ссылка = &Разгрузка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТ_РТУ.РТУ,
		//|	МАКСИМУМ(НЕ ЕСТЬNULL(ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Ссылка, ЗНАЧЕНИЕ(Документ.ВыкупСОтветственногоХранения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.ВыкупСОтветственногоХранения.ПустаяСсылка)) КАК ЕстьВыкуп
		//|ПОМЕСТИТЬ ВТ_Выкупы
		//|ИЗ
		//|	ВТ_РТУ КАК ВТ_РТУ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения.ДокументыОснованияВыкупаТОХ КАК ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ
		//|		ПО ВТ_РТУ.РТУ.Ссылка = ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.ДокументОснование
		//|			И (НЕ ВыкупСОтветственногоХраненияДокументыОснованияВыкупаТОХ.Ссылка.ПометкаУдаления)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_РТУ.РТУ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_РТУ.РТУ,
		//|	МИНИМУМ(ВЫБОР
		//|			КОГДА ВТ_Выкупы.ЕстьВыкуп
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ВТ_РТУ.ПоменятьСтатус
		//|		КОНЕЦ) КАК ПоменятьСтатус
		//|ИЗ
		//|	ВТ_РТУ КАК ВТ_РТУ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Выкупы КАК ВТ_Выкупы
		//|		ПО ВТ_РТУ.РТУ = ВТ_Выкупы.РТУ
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_РТУ.РТУ";
		//-Кабанов А.В. 10.03.2025 # UT10-5127
		
		ЗапросРТУ.УстановитьПараметр("Разгрузка", Ссылка);
		
		ТаблицаРеализаций = ЗапросРТУ.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРТУ ИЗ ТаблицаРеализаций Цикл
			
			Если НЕ СтрокаРТУ.РТУ.ПометкаУдаления Тогда
				
				Если НЕ СтрокаРТУ.ПоменятьСтатус Тогда
					
					РТУОбъект = СтрокаРТУ.РТУ.ПолучитьОбъект();
					РТУОбъект.УстановитьПометкуУдаления(Истина);
					
				Иначе
					УстановитьСтатусПереносДоставки(СтрокаРТУ.РТУ);				
				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЦикла;

		ПромДатаПереноса = Дата(1,1,1);
		
		Для Каждого ЗаписьГМ Из ГрузовыеМеста Цикл  
			
			ПромДатаПереноса = НачалоДня(ЗаписьГМ.ДатаПереноса);
			
			Если ЗаписьГМ.ГрузовоеМесто.Погружено Тогда 
				
				ГМОбъект = ЗаписьГМ.ГрузовоеМесто.ПолучитьОбъект();
				ГМОбъект.Погружено = Ложь;
				ГМОбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			Если НЕ ЗаписьГМ.ПринятоСкладом Тогда
				
				Если ЗаписьГМ.ПереданоНаСклад Тогда
					
					ЕстьВСпискеГМСклад = СписокГМСклад.Найти(ЗаписьГМ.ГрузовоеМесто,"Ссылка");
					
					Если ЕстьВСпискеГМСклад = Неопределено Тогда			
						
						НоваяСтрокаСпискаГМСклад        = СписокГМСклад.Добавить();
						НоваяСтрокаСпискаГМСклад.Ссылка = ЗаписьГМ.ГрузовоеМесто;
						НоваяСтрокаСпискаГМСклад.Номер  = "%Место " + ОбщегоНазначения.ПолучитьНомерНаПечать(ЗаписьГМ.ГрузовоеМесто,,, Истина) + "%";
						
					КонецЕсли;	
					
				Иначе
					
					ЕстьВСпискеГМВодитель = СписокГМВодитель.Найти(ЗаписьГМ.ГрузовоеМесто,"Ссылка");
					
					Если ЕстьВСпискеГМВодитель = Неопределено Тогда
						
						НоваяСтрокаСпискаГМВодители        = СписокГМВодитель.Добавить();
						НоваяСтрокаСпискаГМВодители.Ссылка = ЗаписьГМ.ГрузовоеМесто;
						НоваяСтрокаСпискаГМВодители.Номер  = "%Место " + ОбщегоНазначения.ПолучитьНомерНаПечать(ЗаписьГМ.ГрузовоеМесто,,, Истина) + "%";
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если НЕ НачалоДня(ЗаписьГМ.ГрузовоеМесто.Сборка.ДатаДоставкиКлиенту) = НачалоДня(ЗаписьГМ.ДатаПереноса) Тогда  
					
					СборкаОбъект = ЗаписьГМ.ГрузовоеМесто.Сборка.ПолучитьОбъект();
					СборкаОбъект.ДатаДоставкиКлиенту = НачалоДня(ЗаписьГМ.ДатаПереноса) + 3600;
					СборкаОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		Если НЕ СписокГМСклад.Количество() = 0 Тогда
			СоздатьКорректировкуСборки(Отказ,СписокГМСклад,Перечисления.ПричиныКорректировкиСборки.Недостача); 			
		КонецЕсли;			
		
		Если НЕ СписокГМВодитель.Количество() = 0 Тогда
			СоздатьКорректировкуСборки(Отказ,СписокГМВодитель,Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика); 			
		КонецЕсли;	
		
		Если НЕ Отказ Тогда 
			
			Если ЗначениеЗаполнено(ПромДатаПереноса) И НЕ ТаблицаРеализаций.Количество() = 0 Тогда
				ОтправитьПисьмоОПереносеДоставки(ТаблицаРеализаций , ПромДатаПереноса); 
			КонецЕсли;		
			
			СписокСборок = Новый СписокЗначений;
			
			Для Каждого ТекСтрокаДоставка Из ГрузовыеМеста Цикл
				
				ЕстьСборкаВСписке = СписокСборок.НайтиПоЗначению(ТекСтрокаДоставка.ГрузовоеМесто.Сборка);
				
				Если ЕстьСборкаВСписке = Неопределено Тогда
					СписокСборок.Добавить(ТекСтрокаДоставка.ГрузовоеМесто.Сборка);
				КонецЕсли;			
				
			КонецЦикла;		
			
			Движения.ЗаданиеНаДоставку.Записывать = Истина;
			Движения.ЗаданиеНаДоставку.Очистить();
			
			Для Каждого ТекСтрокаДоставка Из СписокСборок Цикл
				
				Движение                 = Движения.ЗаданиеНаДоставку.Добавить();
				Движение.Период          = Дата;
				Движение.ЗаданиеНаСборку = ТекСтрокаДоставка.Значение;
				Движение.Водитель        = Водитель;
				Движение.Контрагент      = Грузополучатель;
				Движение.Количество      = -1;
				
			КонецЦикла;
			
			ОбъектЗадание = ЗаданиеНаДоставку.ПолучитьОбъект();
			
			Для Каждого ТекСтрокаДоставка Из СписокСборок Цикл
				
				ЕстьСборкаВТаблЧасти = ОбъектЗадание.Доставка.Найти(ТекСтрокаДоставка.Значение,"ДокументСборки");
				
				Если НЕ ЕстьСборкаВТаблЧасти = Неопределено Тогда
					ЕстьСборкаВТаблЧасти.Отменено = Истина;
				КонецЕсли;				
				
			КонецЦикла;
			
			ОбъектЗадание.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				ОбъектЗадание.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;  	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ГМПринял = Справочники.ФизическиеЛица.ПустаяСсылка();
	ГМПоложилНаМаршрут = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Для Каждого ЗаписьГМ Из ГрузовыеМеста Цикл
		
		ЗаписьГМ.ПереданоНаСклад = Ложь;
		ЗаписьГМ.ПринятоСкладом = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура СоздатьКорректировкуСборки(Отказ, СписокГМ, ПромПричина)
	
	ЗапросТоваровДляКорректировки = Новый Запрос;
	ЗапросТоваровДляКорректировки.Текст =
	"ВЫБРАТЬ
	|	Константы.ЯчейкаДоВыяснения
	|ПОМЕСТИТЬ Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокГМ.Ссылка,
	|	СписокГМ.Номер
	|ПОМЕСТИТЬ СписокГМИзПараметра
	|ИЗ
	|	&СписокГМ КАК СписокГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовоеМестоТовары.Ссылка.Сборка,
	|	СписокГМИзПараметра.Номер,
	|	ГрузовоеМестоТовары.Номенклатура,
	|	СУММА(ГрузовоеМестоТовары.Количество) КАК Количество,
	|	ГрузовоеМестоТовары.Заказ
	|ПОМЕСТИТЬ СписокТоваров
	|ИЗ
	|	СписокГМИзПараметра КАК СписокГМИзПараметра
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	|		ПО СписокГМИзПараметра.Ссылка = ГрузовоеМестоТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрузовоеМестоТовары.Заказ,
	|	ГрузовоеМестоТовары.Номенклатура,
	|	СписокГМИзПараметра.Номер,
	|	ГрузовоеМестоТовары.Ссылка.Сборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка,
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(СписокТоваров.Количество, 0) >= СборкаЗаказовПокупателяЗаказано.Факт
	|				ТОГДА СборкаЗаказовПокупателяЗаказано.Факт
	|			ИНАЧЕ ЕСТЬNULL(СписокТоваров.Количество, 0) - СборкаЗаказовПокупателяЗаказано.Факт
	|		КОНЕЦ) КАК Корректировать,
	|	МАКСИМУМ(СборкаЗаказовПокупателяЗаказано.Факт) КАК ПоДокументу
	|ПОМЕСТИТЬ ТаблицаИтого
	|ИЗ
	|	СписокТоваров КАК СписокТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|		ПО СписокТоваров.Сборка = СборкаЗаказовПокупателяЗаказано.Ссылка
	|			И СписокТоваров.Номенклатура = СборкаЗаказовПокупателяЗаказано.Номенклатура
	|			И (СборкаЗаказовПокупателяЗаказано.ГрузовоеМесто ПОДОБНО СписокТоваров.Номер)
	|			И СписокТоваров.Заказ = СборкаЗаказовПокупателяЗаказано.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказовПокупателяЗаказано.Ссылка,
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИтого.Ссылка КАК Сборка,
	|	ТаблицаИтого.Заказ КАК ЗаказПокупателя,
	|	ТаблицаИтого.Номенклатура КАК Номенклатура,
	|	ТаблицаИтого.Заказ.СкладГруппа КАК Склад,
	|	ВЫБОР
	|		КОГДА &Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
	|			ТОГДА ТаблицаИтого.Ячейка
	|		ИНАЧЕ Константа.ЯчейкаДоВыяснения
	|	КОНЕЦ КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ТаблицаИтого.Корректировать <= ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
	|			ТОГДА ТаблицаИтого.Корректировать
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаИтого.Корректировать <= ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
	|			ТОГДА ТаблицаИтого.Корректировать
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
	|	КОНЕЦ КАК Факт,
	|	&Причина,
	|	ВЫБОР
	|		КОГДА &Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаИтого.Ячейка
	|	КОНЕЦ КАК ПроблемнаяЯчейка,
	|	ЕСТЬNULL(ЗаказыОстатки.Цена, 0) КАК Цена
	|ИЗ
	|	ТаблицаИтого КАК ТаблицаИтого
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки КАК ТоварыВСборкеОстатки
	|		ПО ТаблицаИтого.Ссылка = ТоварыВСборкеОстатки.Сборка
	|			И ТаблицаИтого.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
	|			И ТаблицаИтого.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|			ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|			МАКСИМУМ(ВЫРАЗИТЬ(ЗаказыПокупателейОстатки.СуммаВзаиморасчетовОстаток / ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 1) КАК ЧИСЛО(15, 2))) КАК Цена
	|		ИЗ
	|			РегистрНакопления.ЗаказыПокупателей.Остатки(
	|					,
	|					(ЗаказПокупателя, Номенклатура, ИСТИНА) В
	|						(ВЫБРАТЬ
	|							ТаблицаИтого.Заказ КАК ЗаказПокупателя,
	|							ТаблицаИтого.Номенклатура КАК Номенклатура,
	|							ИСТИНА
	|						ИЗ
	|							ТаблицаИтого КАК ТаблицаИтого)) КАК ЗаказыПокупателейОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|			ЗаказыПокупателейОстатки.Номенклатура) КАК ЗаказыОстатки
	|		ПО ТаблицаИтого.Заказ = ЗаказыОстатки.ЗаказПокупателя
	|			И ТаблицаИтого.Номенклатура = ЗаказыОстатки.Номенклатура,
	|	Константа КАК Константа
	|ГДЕ
	|	НЕ ТаблицаИтого.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаИтого.Ссылка,
	|	Номенклатура"; 
	
	ЗапросТоваровДляКорректировки.УстановитьПараметр("СписокГМ", СписокГМ);
	ЗапросТоваровДляКорректировки.УстановитьПараметр("Причина", ПромПричина);

	РезультатЗапросаТоварыДляКорректировки = ЗапросТоваровДляКорректировки.Выполнить();

	Если НЕ РезультатЗапросаТоварыДляКорректировки.Пустой() Тогда

		КомментарийГМ = "";

		Для Каждого СтрокаГМ Из СписокГМ Цикл
			
			ПромГМ = СтрокаГМ.Ссылка;
			КомментарийГМ = КомментарийГМ + ?(КомментарийГМ = "", "", ",") + СокрЛП(ПромГМ.Номер);		
			
		КонецЦикла;

		ВыборкаТоварыДляКорректировки = РезультатЗапросаТоварыДляКорректировки.Выбрать();

		ТекСборка = Неопределено;
		НовыйДокументКорректировкаСборки = Неопределено;

		Пока ВыборкаТоварыДляКорректировки.Следующий() Цикл

			Если НЕ ТекСборка = ВыборкаТоварыДляКорректировки.Сборка Тогда

				ТекСборка = ВыборкаТоварыДляКорректировки.Сборка;

				Если НЕ НовыйДокументКорректировкаСборки = Неопределено Тогда

					Попытка
						НовыйДокументКорректировкаСборки.ПровестиИСоздатьКорректировкиЗаказа();
					Исключение 
						Отказ = Истина;
					КонецПопытки; 					

				КонецЕсли;				

				НовыйДокументКорректировкаСборки = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
				НовыйДокументКорректировкаСборки.Исполнено = Истина;
				НовыйДокументКорректировкаСборки.СборкаЗаказовПокупателя = ВыборкаТоварыДляКорректировки.Сборка;
				НовыйДокументКорректировкаСборки.Контрагент	=	ВыборкаТоварыДляКорректировки.Сборка.Контрагент;
				НовыйДокументКорректировкаСборки.Грузополучатель =	ВыборкаТоварыДляКорректировки.Сборка.Грузополучатель;
				НовыйДокументКорректировкаСборки.Организация	=	ВыборкаТоварыДляКорректировки.Сборка.Организация;		
				НовыйДокументКорректировкаСборки.Ответственный	=	ВыборкаТоварыДляКорректировки.Сборка.Ответственный;	
				НовыйДокументКорректировкаСборки.Дата	=	ТекущаяДата();
				НовыйДокументКорректировкаСборки.Комментарий = "Потеря " + ?(ПромПричина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика, 
				                                    "водителем" + СокрЛП(ЗаданиеНаДоставку.Водитель), "складом") + " грузомест " + СокрЛП(КомментарийГМ);

			КонецЕсли;

			НоваяСтрокаКорректировки = НовыйДокументКорректировкаСборки.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКорректировки, ВыборкаТоварыДляКорректировки);			

		КонецЦикла;

		Если НЕ НовыйДокументКорректировкаСборки = Неопределено И НЕ НовыйДокументКорректировкаСборки.Проведен Тогда

			Попытка
				НовыйДокументКорректировкаСборки.ПровестиИСоздатьКорректировкиЗаказа();
			Исключение 
				Отказ = Истина;
			КонецПопытки

		КонецЕсли;

		Попытка

			Для Каждого СтрокаГМ Из СписокГМ Цикл

				ПромГМ = СтрокаГМ.Ссылка;

				Если НЕ ПромГМ.ПометкаУдаления И НЕ СтрокаГМ.Ссылка.Неактуально_КорректировкаСборки Тогда

					ОбъектГМ = ПромГМ.Получитьобъект();
					ОбъектГМ.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
					ОбъектГМ.Неактуально_КорректировкаСборки = Истина;
					ОбъектГМ.ПометкаУдаления =  Истина;
					ОбъектГМ.Записать(РежимЗаписиДокумента.Запись);

				КонецЕсли;			

			КонецЦикла;

		Исключение 

			Отказ = Истина;

		КонецПопытки;

		Если ПромПричина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика Тогда

			ВыборкаТоварыДляДокументовПоВодителю = РезультатЗапросаТоварыДляКорректировки.Выбрать();

			ДокументЗаказНаВодителя = Документы.ЗаказПокупателя.СоздатьДокумент();
			ДокументЗаказНаВодителя.Дата = ТекущаяДата();
			ДокументЗаказНаВодителя.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;
			ДокументЗаказНаВодителя.Контрагент = Константы.КонтрагентВодитель.Получить();
			ДокументЗаказНаВодителя.Грузополучатель = ДокументЗаказНаВодителя.Контрагент;
			ДокументЗаказНаВодителя.ДоговорКонтрагента = ДокументЗаказНаВодителя.Контрагент.ОсновнойДоговорКонтрагента;
			ДокументЗаказНаВодителя.ВалютаДокумента = ДокументЗаказНаВодителя.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			ДокументЗаказНаВодителя.КратностьВзаиморасчетов = 1;
			ДокументЗаказНаВодителя.КурсВзаиморасчетов = 1;
			ДокументЗаказНаВодителя.Организация = ДокументЗаказНаВодителя.ДоговорКонтрагента.Организация;
			ДокументЗаказНаВодителя.IDСклада = ?(Константы.FTPВыгрузкаОстатковКаталог.Получить() = "", "1", Константы.FTPВыгрузкаОстатковКаталог.Получить());
			ДокументЗаказНаВодителя.СкладГруппа = Константы.ОсновнойСклад.Получить();
			ДокументЗаказНаВодителя.УчитыватьНДС = Истина;
			ДокументЗаказНаВодителя.СуммаВключаетНДС = Истина; 
			ДокументЗаказНаВодителя.Комментарий = "Потеря водителем " + СокрЛП(ЗаданиеНаДоставку.Водитель) + " грузомест " + СокрЛП(КомментарийГМ); 		

			Пока ВыборкаТоварыДляДокументовПоВодителю.Следующий() Цикл

				НоваяСтрокаЗаказа = ДокументЗаказНаВодителя.Товары.Добавить();
				НоваяСтрокаЗаказа.Номенклатура = ВыборкаТоварыДляДокументовПоВодителю.Номенклатура;
				НоваяСтрокаЗаказа.ЕдиницаИзмерения = НоваяСтрокаЗаказа.Номенклатура.ЕдиницаХраненияОстатков;
				ДокументЗаказНаВодителя.ПриИзмененииНоменклатурыТоваров(НоваяСтрокаЗаказа); 
				НоваяСтрокаЗаказа.Количество   = ВыборкаТоварыДляДокументовПоВодителю.Количество;
				НоваяСтрокаЗаказа.Цена		   = ВыборкаТоварыДляДокументовПоВодителю.Цена;
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрокаЗаказа, ДокументЗаказНаВодителя);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаЗаказа, ДокументЗаказНаВодителя);  			

			КонецЦикла;

			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ВидимостьСерии",     Истина);
			СтруктураПараметров.Вставить("Авторезервирование", Истина);
			СтруктураПараметров.Вставить("Авторазмещение",     Ложь);
			СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам);		

			ДокументЗаказНаВодителя.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);

			МСКWEB.ОбработкаРазмещенияИЦенЗаказаПокупателя(ДокументЗаказНаВодителя);

			Попытка
				ДокументЗаказНаВодителя.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ  = Истина;
			КонецПопытки;

			Если НЕ Отказ И  ДокументЗаказНаВодителя.Проведен Тогда

				ДокСборка = Документы.СборкаЗаказовПокупателя.СоздатьДокумент();
				ДокСборка.Дата 				  = ДокументЗаказНаВодителя.Дата+1;
				ДокСборка.Контрагент 		  = ДокументЗаказНаВодителя.Контрагент;
				ДокСборка.Грузополучатель 	  = ДокументЗаказНаВодителя.Грузополучатель;
				ДокСборка.МаршрутДоставки 	  = Справочники.МаршрутыДоставки.ПустаяСсылка();
				ДокСборка.Договор 			  = ДокументЗаказНаВодителя.ДоговорКонтрагента;
				ДокСборка.СпособДоставки 	  = ДокументЗаказНаВодителя.СпособДоставки;
				ДокСборка.Дата 				  = ТекущаяДата();
				ДокСборка.ВремяНачалаСборки   = ТекущаяДата();
				ДокСборка.ВремяОкончанияСборки= ТекущаяДата();
				ДокСборка.ДатаДоставкиКлиенту = ТекущаяДата();
				ДокСборка.Организация 		  = ДокументЗаказНаВодителя.Организация;
				ДокСборка.Ответственный		  = ЗаданиеНаДоставку.Водитель;
				ВыборкаСборкаДляДокументовПоВодителю = РезультатЗапросаТоварыДляКорректировки.Выбрать();

				Пока ВыборкаСборкаДляДокументовПоВодителю.Следующий() Цикл

					НоваяСтрокаСборки = ДокСборка.Заказано.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСборки, ВыборкаСборкаДляДокументовПоВодителю);
					НоваяСтрокаСборки.Подборка = Перечисления.ПодборкаНоменклатуры.Собрано;
					НоваяСтрокаСборки.Заказ = ДокументЗаказНаВодителя.Ссылка;

				КонецЦикла;

				ДокСборка.КоличествоУпаковочныхМест = 1;
				ДокСборка.ДокументСобранИУпакован = Истина;

				Попытка
					ДокСборка.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Отказ = Истина; 
				КонецПопытки;

			КонецЕсли;

			Если НЕ Отказ И ДокСборка.Проведен Тогда
				СоздатьРеализациюПоВодителю(ДокСборка.Ссылка,СокрЛП(ДокументЗаказНаВодителя.Комментарий),Отказ);
			КонецЕсли;	
			
		КонецЕсли;		
		
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьСтатусПереносДоставки(ДокументРеализации)
	
	СтатусДоставки = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусДоставки.Отбор.Объект.Установить(ДокументРеализации);
	СтатусДоставки.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусДоставки.Прочитать(); 
	СтатусДоставки.Очистить();
		
	НовыйСтатусДоставки          = СтатусДоставки.Добавить();
	НовыйСтатусДоставки.Объект   = ДокументРеализации;
	НовыйСтатусДоставки.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки;
	НовыйСтатусДоставки.Значение = Перечисления.СтатусыДоставки.ПереносДоставки;
	
	СтатусДоставки.Записать();

	УстановитьПривилегированныйРежим(Ложь);	

КонецПроцедуры

Процедура СоздатьРеализациюПоВодителю(ДокСборка, ПромКомментарий, Отказ)
	
	Рубль = Справочники.Валюты.НайтиПоКоду("643");	
	
	ЗапросПоСборке = Новый Запрос;
	ЗапросПоСборке.Текст =
	"ВЫБРАТЬ
	|	ИзСборки.Грузополучатель КАК Грузополучатель,
	|	ИзСборки.Договор,
	|	ИзСборки.Ответственный КАК Водитель,
	|	ИзСборки.СпособДоставки,
	|	ИзСборки.ДоговорВладелец КАК Контрагент
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		СборкаЗаказовПокупателя.Грузополучатель КАК Грузополучатель,
	|		СборкаЗаказовПокупателя.Договор КАК Договор,
	|		СборкаЗаказовПокупателя.Ответственный КАК Ответственный,
	|		СборкаЗаказовПокупателя.СпособДоставки КАК СпособДоставки,
	|		СборкаЗаказовПокупателя.Договор.Владелец КАК ДоговорВладелец
	|	ИЗ
	|		Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
	|	ГДЕ
	|		СборкаЗаказовПокупателя.Ссылка = &Сборка) КАК ИзСборки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.Контрагент,
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.Сборка.Грузополучатель КАК Грузополучатель,
	|	ТоварыВСборкеОстатки.Сборка.Договор КАК Договор,
	|	ТЗ.Водитель,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Цена, 0) * ВЫБОР
	|		КОГДА ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) > 0
	|				И ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) > 0
	|			ТОГДА КурсыВалютыЦены.Курс / КурсыВалютыЦены.Кратность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ТоварыВСборкеОстатки.СобраноОстаток КАК Количество
	|ПОМЕСТИТЬ ТоварыВСборке
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(, Сборка = &Сборка) КАК ТоварыВСборкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	|		ПО ТоварыВСборкеОстатки.Сборка.Грузополучатель = ТЗ.Грузополучатель
	|			И (ТЗ.Договор = ТоварыВСборкеОстатки.Сборка.Договор)
	|			И (ТЗ.СпособДоставки = ТоварыВСборкеОстатки.Сборка.СпособДоставки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ТоварыВСборкеОстатки.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
	|			И ТоварыВСборкеОстатки.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютыЦены
	|		ПО (ЗаказПокупателяТовары.Ссылка.ВалютаДокумента = КурсыВалютыЦены.Валюта)
	|ГДЕ
	|	ТоварыВСборкеОстатки.СобраноОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборке.Контрагент,
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.Номенклатура,
	|	ТоварыВСборке.Грузополучатель,
	|	ТоварыВСборке.Договор,
	|	ТоварыВСборке.Водитель,
	|	СУММА(ТоварыВСборке.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабСборкиГруппа
	|ИЗ
	|	ТоварыВСборке КАК ТоварыВСборке
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборке.Контрагент,
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.Номенклатура,
	|	ТоварыВСборке.Грузополучатель,
	|	ТоварыВСборке.Договор,
	|	ТоварыВСборке.Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВСборке.Грузополучатель,
	|	ТоварыВСборке.Договор,
	|	ТоварыВСборке.Сборка КАК ДокументСборки,
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.ЗаказПокупателя.ОплатаНаличными КАК ОплатаНаличными
	|ИЗ
	|	ТоварыВСборке КАК ТоварыВСборке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК Заказ,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры1,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТаблицаРезерва
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			(Номенклатура, ДокументРезерва) В
	|				(ВЫБРАТЬ
	|					ТабСборкиГруппа.Номенклатура,
	|					ТабСборкиГруппа.ЗаказПокупателя
	|				ИЗ
	|					ТабСборкиГруппа КАК ТабСборкиГруппа)) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабСборкиГруппа.Контрагент КАК Контрагент,
	|	ТабСборкиГруппа.Договор КАК Договор,
	|	ТабСборкиГруппа.Грузополучатель КАК Грузополучатель,
	|	ТабСборкиГруппа.Номенклатура КАК Номенклатура,
	|	ТабСборкиГруппа.ЗаказПокупателя КАК Заказ,
	|	ТаблицаРезерва.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаРезерва.КоличествоОстаток КАК КоличествоВРезерве,
	|	ТабСборкиГруппа.Количество КАК КоличествоСобрано,
	|	ТабСборкиГруппа.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	ТабСборкиГруппа.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	ТабСборкиГруппа.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТабСборкиГруппа.Водитель,
	|	ТабСборкиГруппа.ЗаказПокупателя.ОплатаНаличными КАК ОплатаНаличными,
	|	ТабСборкиГруппа.ЗаказПокупателя
	|ПОМЕСТИТЬ ТаблицаСборкиИтог
	|ИЗ
	|	ТабСборкиГруппа КАК ТабСборкиГруппа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРезерва КАК ТаблицаРезерва
	|		ПО ТабСборкиГруппа.ЗаказПокупателя = ТаблицаРезерва.Заказ
	|			И ТабСборкиГруппа.Номенклатура = ТаблицаРезерва.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСборкиИтог.Контрагент КАК Контрагент,
	|	ТаблицаСборкиИтог.Договор КАК Договор,
	|	ТаблицаСборкиИтог.Грузополучатель КАК Грузополучатель,
	|	ТаблицаСборкиИтог.Номенклатура КАК Номенклатура,
	|	ТаблицаСборкиИтог.Заказ КАК Заказ,
	|	ТаблицаСборкиИтог.СерияНоменклатуры,
	|	ТаблицаСборкиИтог.КоличествоВРезерве,
	|	ТаблицаСборкиИтог.КоличествоСобрано,
	|	ТаблицаСборкиИтог.ЕдиницаХраненияОстатков,
	|	ТаблицаСборкиИтог.Коэффициент,
	|	ТаблицаСборкиИтог.СтавкаНДС,
	|	ТаблицаСборкиИтог.Водитель,
	|	ТаблицаСборкиИтог.ЗаказПокупателя,
	|	ЗаказПокупателяТовары.Комментарий
	|ИЗ
	|	ТаблицаСборкиИтог КАК ТаблицаСборкиИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ТаблицаСборкиИтог.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|			И ТаблицаСборкиИтог.Заказ = ЗаказПокупателяТовары.Ссылка
	|			И ТаблицаСборкиИтог.СерияНоменклатуры = ЗаказПокупателяТовары.СерияНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	Грузополучатель,
	|	Номенклатура
	|ИТОГИ ПО
	|	Контрагент,
	|	Договор,
	|	Грузополучатель,
	|	Номенклатура,
	|	Заказ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЭлАдрес
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (ТЗ.Грузополучатель = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|	И НЕ ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.Контрагенты).НеПосылатьУведомлениеОДолгах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.Цена КАК Цена,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Остаток,
	|	0 КАК УжеУчли
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя В
	|					(ВЫБРАТЬ
	|						ТоварыВСборке.ЗаказПокупателя
	|					ИЗ
	|						ТоварыВСборке КАК ТоварыВСборке)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ТоварыВСборке.Номенклатура
	|					ИЗ
	|						ТоварыВСборке КАК ТоварыВСборке)) КАК ЗаказыПокупателейОстатки" ;
	
	ЗапросПоСборке.УстановитьПараметр("Сборка", ДокСборка);

	Пакет = ЗапросПоСборке.ВыполнитьПакет();
	
	Результат = Пакет[6];
	ТабСборок = Пакет[3].Выгрузить();
	ТаблицаОстатков_ПоРегистру_ЗаказыПокупателей  =  Пакет[8].Выгрузить();

	Док = Неопределено;
	
	ВыборкаПоКонтрагентам  = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКонтрагентам.Следующий() Цикл	
		
		ВыборкаПоДоговорам  = ВыборкаПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоДоговорам.Следующий() Цикл
			
			ВыборкаПоГрузополучателям  = ВыборкаПоДоговорам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоГрузополучателям.Следующий() Цикл
				
				СозданХотяБыОдинДокумент = Истина;

				Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Док.Дата = ДокСборка.Дата + 1;
				
				Док.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия ;
				Док.Организация = ВыборкаПоДоговорам.Договор.Организация; 
				
				Если Док.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
					
					Док.ОтражатьВБухгалтерскомУчете = Истина;
					Док.ОтражатьВНалоговомУчете = Истина;
					
				КонецЕсли;				  
				
				Док.Контрагент 					= ВыборкаПоГрузополучателям.Контрагент;
				Док.ДоговорКонтрагента 			= ВыборкаПоГрузополучателям.Договор; 
				Док.БанковскийСчетОрганизации 	= Док.Организация.ОсновнойБанковскийСчет; 
				Док.Грузополучатель				= ВыборкаПоГрузополучателям.Грузополучатель;
				
				Док.ОтражатьВУправленческомУчете 	= Истина;
				Док.ВалютаДокумента 				= Рубль;
				Док.УчитыватьНДС 					= Истина;
				Док.СуммаВключаетНДС 				= Истина;
				Док.КурсВзаиморасчетов  			= 1;
				Док.КратностьВзаиморасчетов 		= 1;
				Док.ВидПередачи 					= Перечисления.ВидыПередачиТоваров.СоСклада;
				Док.Ответственный 					= ДокСборка.Ответственный;
				Док.Комментарий						= ПромКомментарий; 		

				// ТЧ Товары
				ВыборкаПоНоменклатуре = ВыборкаПоГрузополучателям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоНоменклатуре.Следующий() Цикл   
					
					// выборка по заказу нужна для того, чтобы отразить разные цены по одной и той же номенклатуре, которые могут быть в разных заказах
					ВыборкаПоЗаказу  = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоЗаказу.Следующий() Цикл 
						
						Выборка = ВыборкаПоЗаказу.Выбрать();
						
						УстановитьКоличество = Истина;
						
						Пока Выборка.Следующий() Цикл 
							
							Если УстановитьКоличество Тогда 
								
								ВсегоКоличество = Выборка.КоличествоСобрано;
								УстановитьКоличество = Ложь;
								Док.Склад 	= Выборка.Заказ.СкладГруппа;
								Док.Водитель 	= Выборка.Водитель;
								
							КонецЕсли;
							
							Если ВсегоКоличество <= 0 Тогда 
								Прервать;
							КонецЕсли;	  
							
							//    Может быть, что номенклатура в "Заказе покупателя" была по разным ценам. Поэтом проверим
							//  1. Надо ли разбивать  текущие данные из запроса на несколько строк
							//  2. Если надо - то по каким ценам
							СтруктураСДанными = ВернутьСтруктуруДляРазбивкиНаНесколькоСтрок(
							
							Выборка.Номенклатура,Выборка.Заказ,Мин(Выборка.КоличествоВРезерве,ВсегоКоличество));
							
							Если СтруктураСДанными.КоличествоСтрок = Неопределено Тогда 
								
								//  Как и ранее
								НоваяСтрока =  Док.Товары.Добавить();
								НоваяСтрока.Номенклатура 			= Выборка.Номенклатура;
								НоваяСтрока.СерияНоменклатуры 	    = Выборка.СерияНоменклатуры;
								НоваяСтрока.ЕдиницаИзмерения 		= Выборка.ЕдиницаХраненияОстатков;
								НоваяСтрока.Коэффициент 			= Выборка.Коэффициент;
								НоваяСтрока.Количество 			    = Мин(Выборка.КоличествоВРезерве,ВсегоКоличество);
								ВсегоКоличество 					= ВсегоКоличество-НоваяСтрока.Количество;
								
								НоваяСтрока.ЗаказПокупателя 		= Выборка.Заказ;
								НоваяСтрока.Цена 					= Выборка.Цена;
								//+Гавриленков В. 23.12.2025 #
								//НоваяСтрока.СтавкаНДС 			    = Выборка.СтавкаНДС;
								НоваяСтрока.СтавкаНДС 				= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(Выборка.Номенклатура, Док.Дата);
								//-Гавриленков В. 23.12.2025 #
								НоваяСтрока.Сумма 				    = НоваяСтрока.Количество * Выборка.Цена;
								НоваяСтрока.СуммаНДС 				= УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
								НоваяСтрока.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
								НоваяСтрока.Комментарий 			= Выборка.Комментарий;
								
							Иначе 
								
								КоличествоНадоРаскидатьПоЦенам =    Мин(Выборка.КоличествоВРезерве,ВсегоКоличество);
								//   Это количество надо разбить на несколько строк
								ТаблицаСКоличествомИЦенами = СтруктураСДанными.ТЗ;
								
								Для каждого ТекСтр  Из ТаблицаСКоличествомИЦенами Цикл
									
									Если КоличествоНадоРаскидатьПоЦенам = 0 Тогда 
										Прервать;
									КонецЕсли;
									
									ТекущеееКоличество =  ТекСтр.Количество;
									ТекущаяЦена =   ТекСтр.Цена;
									
									НоваяСтрока =  Док.Товары.Добавить();
									НоваяСтрока.Номенклатура 			= Выборка.Номенклатура;
									НоваяСтрока.СерияНоменклатуры 	    = Выборка.СерияНоменклатуры;
									НоваяСтрока.ЕдиницаИзмерения 		= Выборка.ЕдиницаХраненияОстатков;
									НоваяСтрока.Коэффициент 			= Выборка.Коэффициент;
									НоваяСтрока.Количество 			    = ТекущеееКоличество;
									ВсегоКоличество 					= ВсегоКоличество - НоваяСтрока.Количество;
									КоличествоНадоРаскидатьПоЦенам      =  КоличествоНадоРаскидатьПоЦенам - НоваяСтрока.Количество;
									
									НоваяСтрока.ЗаказПокупателя 		= Выборка.Заказ;
									НоваяСтрока.Цена 					= ТекущаяЦена;
									//+Гавриленков В. 23.12.2025 #
									//НоваяСтрока.СтавкаНДС 			    = Выборка.СтавкаНДС;
									НоваяСтрока.СтавкаНДС 				= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(Выборка.Номенклатура, Док.Дата);
									//-Гавриленков В. 23.12.2025 #
									НоваяСтрока.Сумма 				    = НоваяСтрока.Количество * ТекущаяЦена;
									НоваяСтрока.СуммаНДС 				= УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
									НоваяСтрока.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
									НоваяСтрока.Комментарий 			= Выборка.Комментарий;
									
								КонецЦикла; 
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
				// Заполнение ТЧ Сборки
				Отбор = Новый Структура();
				Отбор.Вставить("Грузополучатель", ВыборкаПоГрузополучателям.Грузополучатель);
				Отбор.Вставить("Договор", ВыборкаПоДоговорам.Договор);
				СтрокиСборок = ТабСборок.НайтиСтроки(Отбор);
				
				Если СтрокиСборок.Количество() <> 0 Тогда 
					
					Для Каждого ТекСборка ИЗ СтрокиСборок Цикл  
						
						НоваяСтрокаСборки =  Док.ДокументыСборкиЗаказов.Добавить();
						НоваяСтрокаСборки.ДокументСборки = ТекСборка.ДокументСборки;
						
					КонецЦикла; 
					
				КонецЕсли;
				
				Если Док.Товары.Количество()  > 0 Тогда
					
					Док.Записать();
					мСтруктураПараметровВзаиморасчетов = Новый Структура;
					мСтруктураПараметровВзаиморасчетов.Вставить("СтруктураТабличныхЧастей", Новый Структура("Товары, Услуги"));
					мСтруктураПараметровВзаиморасчетов.Вставить("Направление", "Реализация");
					мСтруктураПараметровВзаиморасчетов.Вставить("ЕстьЗаказыВТабличныхЧастях", Истина);
					мСтруктураПараметровВзаиморасчетов.Вставить("ИмяЗаказаВТабличныхЧастях", "ЗаказПокупателя"); 					
					
					УправлениеВзаиморасчетами.ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(Док, мСтруктураПараметровВзаиморасчетов);
					УправлениеВзаиморасчетами.ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(Док, мСтруктураПараметровВзаиморасчетов);
					
					Док.ЗаполнитьЯчейки();
					
					Попытка
						Док.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Отказ = Истина;
					КонецПопытки;

				КонецЕсли; 	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;  
КонецПроцедуры

Функция ВернутьСтруктуруДляРазбивкиНаНесколькоСтрок(Номенклатура,Заказ,КоличествоИзРеализации)
	
	//   Цель функции : вернуть структуру из двух значений.
	//   Первое значение ("КоличествоСтрок") - кол. строк на которые надо разбить текщую строку из запроса
	//   Второе значение ("ТЗ") - таблица значений из двух колонок
	//   Колонка 1 - содержит количество номенклатуры с ценой
	//   Колонка 2-  содержит  саму цену
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Цена");
	
	СтруктураВозврата = Новый Структура();
	МакимумРазныхЦен = КоличествоИзРеализации;

	Для каждого ТекСтр Из ТаблицаОстатков_ПоРегистру_ЗаказыПокупателей Цикл
		
		Если МакимумРазныхЦен = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		Если ТекСтр.Заказ <> Заказ ИЛИ ТекСтр.Номенклатура <> Номенклатура Тогда 
			Продолжить;
		КонецЕсли;

		Если ТекСтр.УжеУчли >= ТекСтр.Остаток Тогда 
			Продолжить;
		КонецЕсли;
		
		НС = ТЗ.Добавить();
		НС.Количество = МИН(ТекСтр.Остаток - ТекСтр.УжеУчли, МакимумРазныхЦен);
		НС.Цена = ТекСтр.Цена;
		//
		ТекСтр.УжеУчли = ТекСтр.УжеУчли +НС.Количество;
		МакимумРазныхЦен = МакимумРазныхЦен - НС.Количество;

	КонецЦикла;  

	СтруктураВозврата.Вставить("КоличествоСтрок", ?(ТЗ.Количество() = 0, Неопределено, ТЗ.Количество()));
	СтруктураВозврата.Вставить("ТЗ", ТЗ);

	Возврат СтруктураВозврата;

КонецФункции

Процедура ОтправитьПисьмоОПереносеДоставки(ТаблицаДокументов , ДатаПереноса)

	АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(Грузополучатель);
	
	Если ЗначениеЗаполнено(АдресЭлПочты) Тогда   
		
		ОтправлятьПочту = Истина;
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();	
		
		Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ОтправлятьПочту = Ложь;
		КонецЕсли;
		
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);	
		Почта = Новый ИнтернетПочта; 
		
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			ОтправлятьПочту = Ложь;  
		КонецПопытки;
		
		Если ОтправлятьПочту Тогда
			
			Для Каждого СтрокаТаблРТУ Из ТаблицаДокументов Цикл  
				
				ПромРТУ = СтрокаТаблРТУ.РТУ;   
				
				Сообщение = Новый ИнтернетПочтовоеСообщение;
				Сообщение.Тема = "Перенос доставки";
				
				МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочты, ";");
				
				Для каждого ТекАдрес Из МассивАдресов Цикл
					Сообщение.Получатели.Добавить(ТекАдрес); 
				КонецЦикла;
				
				Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		
				ТекстТелаПисьма = "</table><p>Уважаемый(ая) " + СокрЛП(Контрагент.НаименованиеПолное) +" !</p>" + Символы.ПС + Символы.ПС; 
				
				СчетФактура = УчетНДС.НайтиПодчиненныйСчетФактуру(ПромРТУ);
				
				ТекстТелаПисьма = ТекстТелаПисьма  + "</table><p>Уведомляем Вас, что по документу <b> Реализация товаров и услуг № " + СокрЛП(ПромРТУ.Номер) 
				                + " от " + СокрЛ(ПромРТУ.Дата) + ?(ЗначениеЗаполнено(СчетФактура), "(Счёт-фактура выданный № " + СокрЛП(СчетФактура.Номер) 
								+ " от " + СокрЛП(СчетФактура.Дата) + ")", "") + "</b> экспедитором был осуществлён перенос доставки." 
								+ ?(ПромРТУ.ПометкаУдаления, " Указанная накладная аннулирована, товар поступит Вам с новым (переоформленным) документом  <b>" 
								+ Формат(ДатаПереноса, "ДЛФ=D"), "") + "</b><br>."; 

				ТелефонОрганизации = ПолучитьТелефонОрганизации(ПромРТУ.Организация);  
				
				Если ЗначениеЗаполнено(ТелефонОрганизации) Тогда
					ТекстТелаПисьма = ТекстТелаПисьма + "</table><p>При возникновении вопросов просим Вас обратиться по телефону " + ТелефонОрганизации + ".<br></p>";
				КонецЕсли;
				
				ТекстТелаПисьма = ТекстТелаПисьма + "</table><p>С Уважением , " + СокрЛП(ПромРТУ.Организация.Наименование) + ".<br> Склад - "  
				                + СокрЛП(Константы.База.Получить()) + "</p>"; 
				
				Сообщение.Тексты.Добавить(ТекстТелаПисьма,ТипТекстаПочтовогоСообщения.HTML);
				
				Попытка
					
					Почта.Послать(Сообщение);
					ТекстСообщения = "Отправлено письмо " + СокрЛП(Грузополучатель.Наименование) + " на адрес " + АдресЭлПочты + " с уведомлением о переносе доставки";
					ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	
					
				Исключение
					
					ТекстСообщения = "НЕ отправлено письмо " + СокрЛП(Грузополучатель.Наименование) + " на адрес " + АдресЭлПочты + " с уведомлением о корректировке сборки";
					ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка",УровеньЖурналаРегистрации.Информация,,, ТекстСообщения + Символы.ПС + ОписаниеОшибки());	

				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

Функция ПолучитьТелефонОрганизации(Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Объект", Организация);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		Возврат СокрЛП(Выборка.Представление);		
	КонецЦикла;      
	
	Возврат ""; 

КонецФункции
